CREATE TABLE schedule (
    id INT AUTO_INCREMENT PRIMARY KEY,
    group_name VARCHAR(50) NOT NULL,
    day VARCHAR(20) NOT NULL,
    pair1 VARCHAR(100),
    pair2 VARCHAR(100),
    pair3 VARCHAR(100),
    pair4 VARCHAR(100),
    pair5 VARCHAR(100),
    pair6 VARCHAR(100)
);

INSERT INTO schedule (group_name, day, pair1, pair2, pair3, pair4, pair5, pair6) VALUES
('КИТ', 'Понедельник', 'Математика', 'Физика', 'Химия', 'История', 'Литература', 'Биология'),
('КИТ', 'Вторник', 'Информатика', 'География', 'Физкультура', 'Русский язык', 'Литература', 'Биология'),
('КИТ', 'Среда', 'Физика', 'Английский язык', 'История', 'Физкультура', 'Математика', 'География'),
('ФЛФ', 'Понедельник', 'Физика', 'История', 'Химия', 'Математика', 'Физкультура', 'Русский язык'),
('ФЛФ', 'Вторник', 'Биология', 'Информатика', 'Литература', 'География', 'Английский язык', 'Математика'),
('ФЛФ', 'Среда', 'Математика', 'Физика', 'География', 'Физкультура', 'Химия', 'Информатика');
('ИЕН', 'Понедельник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИЕН', 'Вторник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИЕН', 'Среда', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ЮФ', 'Понедельник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ЮФ', 'Вторник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ЮФ', 'Среда', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИП', 'Понедельник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИП', 'Вторник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИП', 'Среда', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИФ', 'Понедельник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИФ', 'Вторник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ИФ', 'Среда', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ПИ', 'Понедельник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ПИ', 'Вторник', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6'),
('ПИ', 'Среда', 'Предмет1', 'Предмет2', 'Предмет3', 'Предмет4', 'Предмет5', 'Предмет6');